# GetStackedWallMemberIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Wall..::..GetStackedWallMemberIds Method
Wall Class See Also
---
Get the sub walls which belongs to the wall.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public IList<ElementId> GetStackedWallMemberIds()
```

Visual Basic
---
```text
Public Function GetStackedWallMemberIds As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetStackedWallMemberIds()
```

# ### Return Value
If the wall is a stacked wall, the Ids of the sub will be returned in bottom-top order.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This wall isn't a consistent stacked wall. |

# See Also
Wall Class
Autodesk.Revit.DB Namespace